In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

username = "root"
password = "ManonFire12!" # (or whatever password you chose during mysql installation)
connection = f"mysql+pymysql://{username}:{password}@localhost/movies"
    
engine = create_engine(connection)

In [2]:
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [3]:
basics = pd.read_csv('Data/final_basics.csv.gz',low_memory = False)
ratings = pd.read_csv('Data/final_ratings.csv.gz', low_memory = False)
year_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz', low_memory = False)
year_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz', low_memory = False)

# Genre's Table

## Getting List of Unique Genres

In [4]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance","[Musical, Romance]"
2,tt0113092,movie,For the Cause,For the Cause,0,2000.0,NaN,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
3,tt0114447,movie,The Silent Force,The Silent Force,0,2001.0,NaN,90,Action,[Action]
4,tt0115937,movie,Consequence,Consequence,0,2000.0,NaN,91,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
2989,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller","[Horror, Thriller]"
2990,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,[Action]
2991,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,[Action]
2992,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,[Horror]
2993,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,[Drama]

In [5]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Musical
1,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000.0,NaN,86,"Musical,Romance",Romance
...,...,...,...,...,...,...,...,...,...,...
2989,tt9212730,movie,Yakuza Zombie,Zonbi gokudo,0,2001.0,NaN,87,"Horror,Thriller",Thriller
2990,tt9228234,movie,The Narc Enigma,The Narc Enigma,0,2001.0,NaN,93,Action,Action
2991,tt9412476,movie,Contratiempo Mortal,Contratiempo Mortal,0,2000.0,NaN,90,Action,Action
2992,tt9555974,movie,Haunted School,Gui xue xiao,0,2001.0,NaN,85,Horror,Horror
2993,tt9578462,movie,Crying Sky,Ku qi de tian kong,0,2001.0,NaN,85,Drama,Drama

In [6]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [7]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Thriller',
 'War',
 'Western']

## Create a new `title_genres` table

In [8]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0113026      Musical
1  tt0113026      Romance

## Create a Genre Mapper Dictionary

In [9]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'History': 10,
 'Horror': 11,
 'Music': 12,
 'Musical': 13,
 'Mystery': 14,
 'Reality-TV': 15,
 'Romance': 16,
 'Sci-Fi': 17,
 'Short': 18,
 'Sport': 19,
 'Thriller': 20,
 'War': 21,
 'Western': 22}

## Replace the String Genres in `title_genres` with the New Integer Ids

In [10]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

## Convert the Genre Map Dictionary into a Dataframe

In [11]:
genre_lookup = pd.DataFrame({ 'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})

genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [12]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  23 non-null     object
 1   Genre_ID    23 non-null     int64
dtypes: int64(1), object(1)
memory usage: 496.0+ bytes

## Genre Table

In [13]:
genre_title = genre_lookup['Genre_Name'].fillna('').map(len).max()

genre_schema = {
    "Genre_ID": Integer(),
    "Genre_Name": Text(genre_title+1)
}

In [14]:
genre_lookup.to_sql('genres', engine, dtype=genre_schema, if_exists='replace', index=False)

23

In [15]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

# MySQL

## Basics Table

In [16]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2994 entries, 0 to 2993
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          2994 non-null   object
 1   titleType       2994 non-null   object
 2   primaryTitle    2994 non-null   object
 3   originalTitle   2994 non-null   object
 4   isAdult         2994 non-null   int64
 5   startYear       2994 non-null   float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  2994 non-null   int64
 8   genres          2994 non-null   object
 9   genres_split    2994 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 234.0+ KB

In [17]:
basics = basics.drop(columns = ['originalTitle', 'genres_split'])

In [18]:
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
genres_len = basics['genres'].fillna('').map(len).max()

df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    "genres":Text(genres_len+1),
    "isAdult":Integer(),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [19]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

2994

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

## TMDB Table

In [21]:
tmdb_df = pd.concat([year_2000, year_2001])

In [22]:
tmdb_df = tmdb_df.drop(columns = ['adult', 'backdrop_path', 'belongs_to_collection', 'homepage', 'id', 'original_language', 'original_title', 'overview', 'popularity', 'poster_path', 'production_companies', 'production_countries', 'release_date', 'runtime', 'spoken_languages', 'status', 'tagline', 'title', 'video', 'vote_average', 'vote_count'])

In [28]:
tmdb_df.drop(0, inplace = True)

In [29]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2543 entries, 1 to 1315
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2543 non-null   object
 1   budget         2543 non-null   float64
 2   genres         2543 non-null   object
 3   revenue        2543 non-null   float64
 4   certification  809 non-null    object
dtypes: float64(2), object(3)
memory usage: 119.2+ KB

In [30]:
cert_len = tmdb_df['certification'].fillna('').map(len).max()
id_len = tmdb_df['imdb_id'].fillna('').map(len).max()
genre_len = tmdb_df['genres'].fillna('').map(len).max()

tmdb_schema = {
    "imdb_id": String(id_len+1),
    "revenue": Float(),
    "genres": Text(genre_len+1),
    "budget": Float(),
    "certification": Text(cert_len+1)
}

In [31]:
tmdb_df.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

2543

In [32]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

## Ratings Table

In [ ]:
ratings_df = pd.DataFrame(ratings)
ratings_df.info()

In [ ]:
id_len = ratings_df['tconst'].fillna('').map(len).max()

rating_schema = {
    "tconst": String(id_len+1),
    "averageRating": Float(),
    "numVotes": Integer()
}

In [ ]:
ratings_df.to_sql('rating', engine, dtype=rating_schema, if_exists='replace', index=False)

In [ ]:
engine.execute('ALTER TABLE rating ADD PRIMARY KEY (`tconst`);')

## Title_Genre Table

In [ ]:
title_genres.info()

In [ ]:
id_len = title_genres['tconst'].fillna('').map(len).max()

title_schema = {
    "tconst": String(id_len+1),
    "genre_id": Integer()
}

In [ ]:
title_genres.to_sql('title_genre', engine, dtype=title_schema, if_exists='replace', index=False)

# SQL Queries

In [42]:
tables = '''SHOW TABLES'''

pd.read_sql(tables, engine)

  Tables_in_movies
0           genres
1           rating
2     title_basics
3      title_genre
4        tmdb_data

In [35]:
basics = '''SELECT *
FROM title_basics
LIMIT 5'''

pd.read_sql(basics, engine)

,tconst,titleType,primaryTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,0,2001.0,None,118,"Comedy,Fantasy,Romance"
1,tt0113026,movie,The Fantasticks,0,2000.0,None,86,"Musical,Romance"
2,tt0113092,movie,For the Cause,0,2000.0,None,100,"Action,Adventure,Drama"
3,tt0114447,movie,The Silent Force,0,2001.0,None,90,Action
4,tt0115937,movie,Consequence,0,2000.0,None,91,Drama

In [37]:
genres = '''SELECT *
FROM genres
LIMIT 5'''

pd.read_sql(genres, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [38]:
rating = '''SELECT *
FROM rating
LIMIT 5'''

pd.read_sql(rating, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1961
1  tt0000002            5.8       263
2  tt0000005            6.2      2600
3  tt0000006            5.1       178
4  tt0000007            5.4       817

In [40]:
title_g = '''SELECT *
FROM title_genre
LIMIT 5'''

pd.read_sql(title_g, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        16
3  tt0113026        13
4  tt0113026        16

In [41]:
tmdb = '''SELECT *
FROM tmdb_data
LIMIT 5'''

pd.read_sql(tmdb, engine)

,imdb_id,budget,genres,revenue,certification
0,tt0035423,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",76019000.0,PG-13
1,tt0113026,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",0.0,None
2,tt0113092,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",0.0,None
3,tt0114447,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",0.0,None
4,tt0116391,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",0.0,None